EDTMKERPNEW.Разработка/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="050b09a5-e36c-42b6-b337-cdddd2968bea">
  <name>ПеремещениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="8056c14d-d9f2-47ef-97e6-7fe370ddced3">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3e9defd7-9344-428a-8ef4-e09eba929233">
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5e0798d7-b3c0-41e8-8975-da31000297bb">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fe21f51-bdc5-4aeb-aa69-f841d89eece1">
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="021db3c3-dccb-4cee-a6a4-de5688202aa5">
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee97939f-4b30-4520-9e85-ad37d0c0b7b9">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3159525b-cd00-411c-bd3f-98b839179d20">
    <name>ЗаказНаПеремещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea463269-e7b6-4f55-b097-6ea9c2e3fa41">
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9c4216f-9668-4a36-bd48-16cf76444266">
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d42f272f-d457-42bc-9afb-c687c5236e1d">
    <name>КонтролируемаяПартияОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9c3cea07-4601-4982-94f2-9dbde0d6a9fd">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba7cb94f-7cbe-4ad7-99f9-58c58173ed2b">
    <name>ПеремещениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25dc034f-cb5e-490d-9f3d-d9f2b59ba018">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f945ba8c-cdb8-4782-a03f-342514b50ad3">
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9245a6b4-8e2f-4305-bf6d-a6b67568f8f3">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e9f7a3a-fc17-4f67-a435-90e40e646690">
    <name>ПеремещениеЗаблокированныхТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1cb22b8e-041e-4f12-bc43-4bfb145592f3">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fe41566-0eba-4cca-982f-243456d590d9">
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d0c4ee96-0ab4-456f-af91-60ed790b5896">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="584dfe05-e915-4b93-a2e4-39140048ce5f">
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7548f194-0b26-4212-a089-a5c92c17458b">
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6cf61f94-1052-4a7d-8b0c-3ca30671d5b1">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58093f2e-ad5d-4422-aab0-5e7c1303688d">
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e1ffb49-bf3a-4fd2-b186-b16be6fe8096">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b010d109-701c-4f89-ada2-b197b093cf18">
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb8823b3-497d-4bc3-b75f-2d61a3192b06">
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2ffb7f4e-66c9-48c5-96e0-1baecd646a67">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e044615-411c-4064-b5c2-6f759f904e5f">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b2d564e7-ff07-49ec-9eec-93f796ebb1e8">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9561e1ad-c13b-4e2c-b3de-4ead9a8c45b3">
    <name>ПеремещениеПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f8abbfa-b9cf-4125-94d5-4bb7574640ca">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4578606a-607a-4ca9-8ec4-11176d49979c">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ec1f4519-6787-456f-8137-6e0249afc4c8">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4a32dceb-9f97-4017-97bb-fdde719e559b">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="33a851eb-33a9-46f4-95cf-05669e0ba13b">
      <name>Сделка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2167a38d-255f-4c25-8f24-b24e020c3aff">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2da56ca9-84d3-4903-91c6-72d5734fb71e">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="37a8e607-b3e5-44fd-b88d-414a02fac7c0">
      <name>ЗаказНаПеремещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b7c9108f-923f-417c-9429-f31b7b8bbd59">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7330720c-a492-4981-9a87-51a1ce11fc7f">
      <name>ДатаПодтвержденияКачества</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5d576f74-14c9-4566-b4d8-b0c7708b5033">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5cca2552-e19e-4745-9c8d-4be56a5d9b55">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="10a4c17e-9a41-47b5-92ba-7741926539a9">
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ff02ec4a-7c5b-4356-ab52-7f1a5e696032">
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="44655878-7017-4672-8a71-48caa04b309e">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9d729a90-016a-4d7c-b436-f809080e3bc1">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c7cb8bd5-b4b4-4dd9-8f8c-441ab55a4adf">
      <name>ПроконтролироватьКачество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разр_Штрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDTMKERPNEW.Разработка/src/Documents/ПеремещениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Разр_ДобавитьПоШтрихкодуВместо(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяСобытияОповещения", "ЯрлыкКоробаСчитанПеремещениеТОваров");
	ПараметрыФормы.Вставить("ТекстПодсказки", "Сканируйте штрихкод ярлыка короба.");

	ОткрытьФорму(
		"ОбщаяФорма.Разр_ВводШтрихкодаОдиночный",
		ПараметрыФормы,
		ЭтаФорма
	);
КонецПроцедуры

&НаКлиенте
Процедура Разр_ДобавитьПоШтрихкодамВместо(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяСобытияОповещения", "ЯрлыкиКоробаСчитаныПеремещениеТОваров");
	ПараметрыФормы.Вставить("ТекстПодсказки", "Укажите количество и сканируйте штрихкоды ярлыков коробов.");

	ОткрытьФорму(
		"ОбщаяФорма.Разр_ВводШтрихкодаМассовый",
		ПараметрыФормы,
		ЭтаФорма
	);
КонецПроцедуры

&НаКлиенте
Процедура Разр_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	Настройки = Разр_ЗаполнениеТЧПоЯрлыкамКлиент.НастройкиПоУмолчанию();

	// Здесь можно переопределить имена ТЧ для конкретного документа
	Настройки.ИмяТЧНоменклатуры = "Товары";
	Настройки.ИмяТЧШтрихкодов = "Разр_Штрихкоды";
	Настройки.ИмяТЧСерий = "Серии";
	Настройки.ИмяСобытияОповещения = ИмяСобытия;	
	
	// Переносим спецификацию из данных ярлыка в строку ВыходныеИзделия.
	//Настройки.ПоляИзЯрлыкаВСтроку.Добавить("Распоряжение");	
	
	// Строки с разными спецификациями не должны объединяться.
	//Настройки.КлючевыеПоляСтрок.Добавить("Распоряжение");
	
	
	Если ИмяСобытия = "ЯрлыкКоробаСчитанПеремещениеТОваров" Тогда

		Результат = Разр_ЗаполнениеТЧПоЯрлыкамКлиент.ДобавитьНоменклатуруПоЯрлыку(
			Объект,
			Параметр,
			Настройки
		);

		Если Результат.Изменено Тогда
			Модифицированность = Истина;
		КонецЕсли;

	ИначеЕсли ИмяСобытия = "ЯрлыкиКоробаСчитаныПеремещениеТОваров" Тогда

		Если Параметр = Неопределено 
			Или Не Параметр.Свойство("Ярлыки") Тогда

			ПоказатьПредупреждение(, "Не получены данные массового сканирования.");
			Возврат;

		КонецЕсли;

		Результат = Разр_ЗаполнениеТЧПоЯрлыкамКлиент.ДобавитьНоменклатурыПоЯрлыкам(
			Объект,
			Параметр.Ярлыки,
			Настройки
		);

		Если Результат.Изменено Тогда
			Модифицированность = Истина;
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьТЧ_ТОвары()
    Элементы.Товары.ТолькоПросмотр = Объект.Разр_Штрихкоды.Количество() > 0;
КонецПроцедуры // ОбновитьДоступностьТЧ_ТОвары()

&НаКлиенте
Процедура Разр_ПриОткрытииПосле(Отказ)
	ОбновитьДоступностьТЧ_ТОвары();
КонецПроцедуры

&НаКлиенте
Процедура Разр_Разр_ШтрихкодыПриИзмененииВместо(Элемент)
	ОбновитьДоступностьТЧ_ТОвары();
КонецПроцедуры

&НаКлиенте
Процедура Разр_ОчиститьТабличныеЧастиВместо(Команда)
	Оповещение = Новый ОписаниеОповещения(
		"ПослеВопросаОчиститьЗаполнениеПоШтрихкодам",
		ЭтаФорма
	);

	ПоказатьВопрос(
		Оповещение,
		"Очистить штрихкоды и товары, заполненные по штрихкодам?",
		РежимДиалогаВопрос.ДаНет
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОчиститьЗаполнениеПоШтрихкодам(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Объект.Разр_Штрихкоды.Очистить();
	Объект.Товары.Очистить();
	Объект.Серии.Очистить();

	Модифицированность = Истина;
	
	ОбновитьДоступностьТЧ_ТОвары();

КонецПроцедуры
